Project/Toir/src/Documents/торо_ИзменениеПоложенияВСтруктуреИерархии/торо_ИзменениеПоложенияВСтруктуреИерархии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_ИзменениеПоложенияВСтруктуреИерархии</name>
  <registerRecords>InformationRegister.торо_РасположениеОРВСтруктуреИерархии</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктураИерархии</name>
    <type>
      <types>CatalogRef.торо_СтруктурыОР</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПоложенияВСтруктуреИерархии</name>
    <attributes>
      <name>ОбъектИерархии</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>РодительИерархии</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Удален</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредыдущееПоложение</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir/src/InformationRegisters/торо_РасположениеОРВСтруктуреИерархии/торо_РасположениеОРВСтруктуреИерархии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_РасположениеОРВСтруктуреИерархии</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>РодительИерархии</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </resources>
  <resources>
    <name>Удален</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектИерархии</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктураИерархии</name>
    <type>
      <types>CatalogRef.торо_СтруктурыОР</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ОсновноеИмяПользователяAD</name>
    <comment>TOIR20-731</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/Documents/торо_ИзменениеПоложенияВСтруктуреИерархии/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПЕРЕМЕННЫЕ
Перем БезусловнаяЗапись Экспорт; // Отключает проверки при записи документа

перем СтруктураДанных Экспорт;  // Структура, хранящая данные для работы с уведомлениями.

#Область ОбработчикиСобытий
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Организация = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиТОиР", "ОсновнаяОрганизация", Истина);
	Подразделение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиТОиР", "ОсновноеПодразделение", Истина);
	Ответственный = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиТОиР", "ОсновнойОтветственный", Справочники.Пользователи.ПустаяСсылка());
	
	Если НЕ ЗначениеЗаполнено(Ответственный) тогда
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;

	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		Если ДанныеЗаполнения.Свойство("СтруктураИерархии") Тогда
			СтруктураИерархии = ДанныеЗаполнения.СтруктураИерархии;	
		КонецЕсли;
		
		Если ДанныеЗаполнения.Свойство("Организация") Тогда
			Организация = ДанныеЗаполнения.Организация;	
		КонецЕсли;

		Если ДанныеЗаполнения.Свойство("Подразделение") Тогда
			Подразделение = ДанныеЗаполнения.Подразделение;	
		КонецЕсли;
		
		Если ДанныеЗаполнения.Свойство("РодительИерархии") И ТипЗнч(ДанныеЗаполнения.РодительИерархии) = Тип("СправочникСсылка.торо_ОбъектыРемонта") Тогда
			РодительИерархии = ДанныеЗаполнения.РодительИерархии;
		Иначе
			РодительИерархии = Справочники.торо_ОбъектыРемонта.ПустаяСсылка();
		КонецЕсли;
		
		// Параметр МассивУдаляемых сохранен для совместимости со старыми функциями работы с иерархией до удаления модулей.
		// В РаботаСИерархией20 не используется, вместо него используется параметр Удаление.
		МассивУдаляемых = Неопределено;
		ДанныеЗаполнения.Свойство("МассивУдаляемых", МассивУдаляемых);
		
		Если ДанныеЗаполнения.Свойство("ОбъектИерархии") И ЗначениеЗаполнено(ДанныеЗаполнения.ОбъектИерархии) Тогда
						
			Если ТипЗнч(ДанныеЗаполнения.ОбъектИерархии) = Тип("СправочникСсылка.торо_ОбъектыРемонта") Тогда
				
				Если ДанныеЗаполнения.Свойство("ПредыдущееПоложение") Тогда
					ПредыдущееПоложение = ДанныеЗаполнения.ПредыдущееПоложение;
				Иначе
					ПредыдущееПоложение = торо_РаботаСИерархией20.ПолучитьТекущегоРодителяВИерархии(ДанныеЗаполнения.ОбъектИерархии, СтруктураИерархии);
				КонецЕсли;
				
				НС = ПоложенияВСтруктуреИерархии.Добавить();
				НС.ОбъектИерархии = ДанныеЗаполнения.ОбъектИерархии;
				НС.РодительИерархии = РодительИерархии;
				НС.ПредыдущееПоложение = ПредыдущееПоложение;
				
				Если ДанныеЗаполнения.Свойство("Удаление") Тогда
					НС.Удален = ДанныеЗаполнения.Удаление;
				ИначеЕсли МассивУдаляемых <> Неопределено Тогда
					НС.Удален = МассивУдаляемых.Найти(НС.ОбъектИерархии) <> Неопределено;
				КонецЕсли;
				
			ИначеЕсли ТипЗнч(ДанныеЗаполнения.ОбъектИерархии) = Тип("Массив") Тогда	
				
				Если ДанныеЗаполнения.Свойство("ИерархияИсточник") Тогда
				// Выполняется перенос из другой структуры иерархии.	
					
					Ветка = торо_РаботаСИерархией20.ПолучитьТекущихРодителейВИерархии(ДанныеЗаполнения.ОбъектИерархии,	ДанныеЗаполнения.ИерархияИсточник);
						
					ПреобразованнаяТаблица = торо_РаботаСИерархией20.ПреобразоватьТаблицуРодителейВИерархииДляПереноса(Ветка, ДанныеЗаполнения.РодительИсточник);	
					
					НеСохранятьИерархию = Ложь;
					Если ДанныеЗаполнения.Свойство("НеСохранятьИерархию") Тогда
						НеСохранятьИерархию = ДанныеЗаполнения.НеСохранятьИерархию;
					КонецЕсли;
					
					Для Каждого КлючИЗначение Из ПреобразованнаяТаблица Цикл
						
						НС = ПоложенияВСтруктуреИерархии.Добавить();
						НС.ОбъектИерархии = КлючИЗначение.Ключ;
						НС.РодительИерархии = ?(КлючИЗначение.Ключ = ДанныеЗаполнения.РодительИсточник ИЛИ НеСохранятьИерархию = Истина, РодительИерархии, КлючИЗначение.Значение);
						НС.ПредыдущееПоложение = КлючИЗначение.Значение;
						
						Если НЕ ЗначениеЗаполнено(НС.ПредыдущееПоложение) Тогда
							НС.ПредыдущееПоложение = "Внесен в структуру иерархии";
						КонецЕсли;
						
						Если ДанныеЗаполнения.Свойство("Удаление") Тогда
							НС.Удален = ДанныеЗаполнения.Удаление;
						ИначеЕсли МассивУдаляемых <> Неопределено Тогда
							НС.Удален = МассивУдаляемых.Найти(НС.ОбъектИерархии) <> Неопределено;
						КонецЕсли;
						
					КонецЦикла;
					
				Иначе
				// Выполняется перенос в пределах текущей структуры иерархии.	
					
					СоответствиеОРИРодителей = торо_РаботаСИерархией20.ПолучитьТекущихРодителейВИерархии(ДанныеЗаполнения.ОбъектИерархии, СтруктураИерархии);
					
					Для Каждого КлючИЗначение Из СоответствиеОРИРодителей Цикл
						
						НС = ПоложенияВСтруктуреИерархии.Добавить();
						НС.ОбъектИерархии = КлючИЗначение.Ключ;
						НС.РодительИерархии = РодительИерархии;
						НС.ПредыдущееПоложение = КлючИЗначение.Значение;
						
						Если ДанныеЗаполнения.Свойство("Удаление") Тогда
							НС.Удален = ДанныеЗаполнения.Удаление;
						ИначеЕсли МассивУдаляемых <> Неопределено Тогда
							НС.Удален = МассивУдаляемых.Найти(НС.ОбъектИерархии) <> Неопределено;
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.торо_РасположениеОРВСтруктуреИерархии.Очистить();
	
	// регистр торо_РасположениеОРВСтруктуреИерархии
	Для Каждого ТекСтрокаПоложенияВСтруктуреИерархии Из ПоложенияВСтруктуреИерархии Цикл
		
		Если Не ТипЗнч(ТекСтрокаПоложенияВСтруктуреИерархии.ОбъектИерархии) = Тип("СправочникСсылка.торо_ОбъектыРемонта") Тогда
			
			НоваяГруппаОР = Справочники.торо_ОбъектыРемонта.СоздатьГруппу();
			НоваяГруппаОР.Наименование = Строка(ТекСтрокаПоложенияВСтруктуреИерархии.ОбъектИерархии);
			
			Попытка
				НоваяГруппаОР.Записать();
				
				СтрокаОбъектИерархии = ТекСтрокаПоложенияВСтруктуреИерархии.ОбъектИерархии;
				
				ТекСтрокаПоложенияВСтруктуреИерархии.ОбъектИерархии = НоваяГруппаОР.Ссылка;
				
				МассивСтрокСЭтимРодителем = ПоложенияВСтруктуреИерархии.НайтиСтроки(Новый Структура("РодительИерархии", СтрокаОбъектИерархии));
				
				Для каждого СтрокаПоложения Из МассивСтрокСЭтимРодителем Цикл
					СтрокаПоложения.РодительИерархии = ТекСтрокаПоложенияВСтруктуреИерархии.ОбъектИерархии;
				КонецЦикла; 
				
			Исключение
				ШаблонСообщения = НСтр("ru = 'Не удалось создать группу объектов ремонта ""%1""'");
				ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекСтрокаПоложенияВСтруктуреИерархии.ОбъектИерархии);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			КонецПопытки;
			
		КонецЕсли; 
		
		
		Движение = Движения.торо_РасположениеОРВСтруктуреИерархии.Добавить();
		Движение.Период = Дата;
		Движение.ОбъектИерархии = ТекСтрокаПоложенияВСтруктуреИерархии.ОбъектИерархии;
		Движение.СтруктураИерархии = СтруктураИерархии;
		Движение.РодительИерархии = ТекСтрокаПоложенияВСтруктуреИерархии.РодительИерархии;
		Движение.Удален = ТекСтрокаПоложенияВСтруктуреИерархии.Удален;
		
	КонецЦикла;
	

КонецПроцедуры

#КонецОбласти

#КонецЕсли
